[AdvCaptainM1_Pistol X2WeaponTemplate]
FriendlyName="ADVENT Mag Pistol"
FriendlyNamePlural="ADVENT Mag Pistols"
BriefSummary="A Magnetic rail pistol of ADVENT design. Generation 1."
TacticalText="<Bullet/> ADVENT Mag Pistol G1."
AbilityDescName="pistol"

[AdvCaptainM2_Pistol X2WeaponTemplate]
FriendlyName="ADVENT Mag Pistol #2"
FriendlyNamePlural="ADVENT Mag Pistols"
BriefSummary="A Magnetic rail pistol of ADVENT design. Generation 2."
TacticalText="<Bullet/> ADVENT Mag Pistol G2."
AbilityDescName="pistol"

[AdvCaptainM3_Pistol X2WeaponTemplate]
FriendlyName="ADVENT Mag Pistol #3"
FriendlyNamePlural="ADVENT Mag Pistols"
BriefSummary="A Magnetic rail pistol of ADVENT design. Generation 3."
TacticalText="<Bullet/> ADVENT Mag Pistol G3."
AbilityDescName="pistol"

[MilitiaPistol_CV X2WeaponTemplate]
FriendlyName="Pistol"
FriendlyNamePlural="Pistols"
BriefSummary="XCOM Sharpshooters carry high-caliber pistols in addition to their sniper rifles. With the proper training, Sharpshooters can pose an enormous threat at close range."
TacticalText="<Bullet/> Pistols can be much more than a sidearm in the hands of a trained Sharpshooter.\n<Bullet/> Unlike the sniper rifle, pistols can be fired with a single action.\n<Bullet/> Sharpshooters can train several abilities that dramatically enhance their use of pistols."
AbilityDescName="pistol"

[MilitiaPistol_MG X2WeaponTemplate]
FriendlyName="Mag Pistol"
FriendlyNamePlural="Mag Pistols"
BriefSummary="Based on the advances in magnetic weapons tech we've achieved, this new pistol boasts a substantial improvement in power over our conventional pistol."
TacticalText="<Bullet/> Magnetic pistols are substantially more effective than their conventional precursors.\n<Bullet/> Unlike the sniper rifle, pistols can be fired with a single action."
AbilityDescName="pistol"

[MilitiaPistol_BM X2WeaponTemplate]
FriendlyName="Beam Pistol"
FriendlyNamePlural="Beam Pistols"
BriefSummary="The ultimate sidearm, this pistol integrates the aliens' beam weapons technology to powerful effect."
TacticalText="<Bullet/> Beam pistols are the most powerful handguns on Earth.\n<Bullet/> Unlike the sniper rifle, pistols can be fired with a single action."
AbilityDescName="pistol"

[AdvPurifierFlamethrowerMK2 X2WeaponTemplate]
FriendlyName="Purifier Flamethrower MK2"
FriendlyNamePlural="Purifier Flamethrowers MK2"
BriefSummary="Purifier Flamethrower MK2"
TacticalText="Purifier Flamethrower MK2"
AbilityDescName="Purifier Flamethrower MK2"

[AdvPurifierFlamethrowerMK3 X2WeaponTemplate]
FriendlyName="Purifier Flamethrower MK3"
FriendlyNamePlural="Purifier Flamethrowers MK3"
BriefSummary="Purifier Flamethrower MK3"
TacticalText="Purifier Flamethrower MK3"
AbilityDescName="Purifier Flamethrower MK3"

[AdvGeneralM1_Wpn X2WeaponTemplate]
FriendlyName="ADVENT Coil Rifle"
FriendlyNamePlural="ADVENT Coil Rifles"
BriefSummary="XCOM has managed to salvage a variety of standard infantry small arms; this is the most common variety, similar to the rifle used twenty years before. While decidedly inferior to ADVENT magnetic technology, it can at least be upgraded using additional weapons salvage, once a standard technical approach is unked."
TacticalText="<Bullet/> Firing the primary weapon always ends the soldier's turn\n<Bullet/> If the soldier fires with both actions available, three shots will be taken at reduced accuracy, but overall increased efficiency\n<Bullet/> Use upgrades looted from enemies to improve assault rifle tactical effectiveness"
AbilityDescName="coil rifle"

[AdvGeneralM2_Wpn X2WeaponTemplate]
FriendlyName="ADVENT Coil Rifle"
FriendlyNamePlural="ADVENT Coil Rifles"
BriefSummary="XCOM has managed to salvage a variety of standard infantry small arms; this is the most common variety, similar to the rifle used twenty years before. While decidedly inferior to ADVENT magnetic technology, it can at least be upgraded using additional weapons salvage, once a standard technical approach is unked."
TacticalText="<Bullet/> Firing the primary weapon always ends the soldier's turn\n<Bullet/> If the soldier fires with both actions available, three shots will be taken at reduced accuracy, but overall increased efficiency\n<Bullet/> Use upgrades looted from enemies to improve assault rifle tactical effectiveness"
AbilityDescName="coil rifle"

[AdvGeneralM3_Wpn X2WeaponTemplate]
FriendlyName="ADVENT Coil Rifle"
FriendlyNamePlural="ADVENT Coil Rifles"
BriefSummary="XCOM has managed to salvage a variety of standard infantry small arms; this is the most common variety, similar to the rifle used twenty years before. While decidedly inferior to ADVENT magnetic technology, it can at least be upgraded using additional weapons salvage, once a standard technical approach is unked."
TacticalText="<Bullet/> Firing the primary weapon always ends the soldier's turn\n<Bullet/> If the soldier fires with both actions available, three shots will be taken at reduced accuracy, but overall increased efficiency\n<Bullet/> Use upgrades looted from enemies to improve assault rifle tactical effectiveness"
AbilityDescName="coil rifle"

[AdvGeneralM1_Pistol X2WeaponTemplate]
FriendlyName="ADVENT Coil Pistol"
FriendlyNamePlural="ADVENT Coil Pistols"
BriefSummary="A Magnetic rail pistol of ADVENT design. Generation 1."
TacticalText="<Bullet/> ADVENT Mag Pistol G1."
AbilityDescName="coil pistol"

[AdvGeneralM2_Pistol X2WeaponTemplate]
FriendlyName="ADVENT Coil Pistol #2"
FriendlyNamePlural="ADVENT Coil Pistols"
BriefSummary="A Magnetic rail pistol of ADVENT design. Generation 2."
TacticalText="<Bullet/> ADVENT Mag Pistol G2."
AbilityDescName="coil pistol"

[AdvGeneralM3_Pistol X2WeaponTemplate]
FriendlyName="ADVENT Coil Pistol #3"
FriendlyNamePlural="ADVENT Coil Pistols"
BriefSummary="A Magnetic rail pistol of ADVENT design. Generation 3."
TacticalText="<Bullet/> ADVENT Mag Pistol G3."
AbilityDescName="coil pistol"

[SectopodLightningField X2AbilityTemplate]
LocFriendlyName="Lightning Field"
LocLongDescription="Erect a force field of energy around the unit, shielding the unit by 10 points and damaging any enemies around it."
LocHelpText="Erect a force field of energy around the unit, shielding the unit by 10 points and damaging any enemies around it."
LocFlyOverText="Lightning Field"

[AdvAvengerM1_Pistol X2WeaponTemplate]
FriendlyName="ADVENT Coil Mag Pistol"
FriendlyNamePlural="ADVENT Coil Mag Pistols"
BriefSummary="The ADVENT Avenger's handgun is Generation 4 Magpower with elerium coils."
TacticalText="<Bullet/> ADVENT Coil Mag Pistol G4."
AbilityDescName="pistol"

[DarkEvent_LightningReflexes X2DarkEventTemplate]
DisplayName="ADVENT Lightning Reflexes"
SummaryText="Overwatch shots will always miss ADVENT officers and lancers on the first shot."
QuoteText="\"My memory may be fuzzy, but do they seem a little faster to you?\""
QuoteTextAuthor="- Central Officer Bradford"
PreMissionText="Overwatch shots will always miss ADVENT officers and lancers on the first shot."
PostMissionSuccessText="Dark Event Countered: ADVENT Lightning Reflexes"
PostMissionFailureText="Failed to Counter Dark Event: ADVENT Lightning Reflexes"
